0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; // m/s

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
   
        type            codedFixedValue;
    	value           uniform (0 0 0);
    	redirectType    smoothU;
    	code
    	#{
          const scalar& t = this->db().time().timeOutputValue();
 
          vector Uav (0, 426.67e-5, 0); //i.e. De = 64, Re = 0.64
          scalar tlim (0.0125); // i.e. lambda

          if (t<=tlim)
           {
             Uav = ( 0.5 - ( 0.5 * Foam::cos ( 3.1415926535897932 * t/tlim) ) ) * Uav;
           }
       
          operator == (Uav);
   	#};

    }
    
    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }

}

// ************************************************************************* //
