system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync   false;

patches
(
    {
        name    inlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom set;
        set     inletFaces;
    }
    
    {
        name    outlet;
        patchInfo
        {
            type    patch;
        }
        constructFrom set;
        set     outletFaces;
    }
    
    {
        name    walls;
        patchInfo
        {
            type    wall;
        }
        constructFrom set;
        set     wallFaces;
    }
);

// ************************************************************************* //
