system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG; 
        tolerance       1e-06;
        relTol          0.001;
        smoother        FDIC;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 100;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }
    
    U
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0.001;
        minIter           3;
        maxIter           1000;
    }

    "(theta|tau)"
    {

        solver           PBiCG;
        preconditioner
        {
            preconditioner DILU;
        }

        tolerance         1e-8;
        relTol            0.001;
        minIter           3;
        maxIter           1000;
    }
 
}
 
PIMPLE {}
SIMPLE
{
    nInIter          6;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;

}

relaxationFactors
{
     fields
      {     
        p 1;
      }

     equations
      { 
        U 1;
        tau 1;
        theta 1;
      }
}

// ************************************************************************* //
