system/probeTopPlane
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
-------------------------------------------------------------------------------

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       (U tau);

surfaceFormat   raw;
formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;


surfaces
(

    topPlane
    {
        $cuttingPlane;
        pointAndNormalDict
        {
            basePoint    (0 0 25e-6);
            normalVector $z;
        }
    }

);

// ************************************************************************* //
