system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Grab faces at a  
// geometry is in meters.
// Grab faces along the bottom surface

// +/- 100 nm resolution (minimum box half-width)
actions
(
    // Inlet
    {
        name    inletFaces;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.0076 -0.00301 -0.1e-6) (0.0076 -0.0029999 50.1e-6); // (xMin yMin zMin) (xMax yMax zMax)
        }
    }
    
    // Outlet
    {
        name    outletFaces;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (-0.0076 100.1e-6 -0.1e-6) (0.0076 1.2e-3 50.1e-6); 
        } 
    }
    { // Use boundaryToFace to select only the subset of external (boundary) faces
        name    outletFaces;
        type    faceSet;
        action  subset;
        source  boundaryToFace;
        sourceInfo
        {
        } 
    }

    // Walls
    { // Use three boxes to capture top, bottom, and sides
        name    wallFaces;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {          
            box (-0.0076 -0.00301 -0.1e-6) (0.0076 1.2e-3 0.1e-6); // bottom
        } 
    }
    {
        name    wallFaces;
        type    faceSet;
        action  add;
        source  boxToFace;
        sourceInfo
        {          
            box (-0.0076 -0.00301 49.9e-6) (0.0076 1.2e-3 50.1e-6); // top
        } 
    }
    {
        name    wallFaces;
        type    faceSet;
        action  add;
        source  boxToFace;
        sourceInfo
        {          
            box (-0.0076 -0.0029999 0.1e-6) (0.0076 100.1e-6 49.9e-6); // sides
        } 
    }
    { // select external (i.e. boundary) faces
        name    wallFaces;
        type    faceSet;
        action  subset;
        source  boundaryToFace;
        sourceInfo
        {
        } 
    }
);

// ************************************************************************* //
